apache/nuttx/arch/arm/src/efm32/efm32_leserial.c
/****************************************************************************
 * arch/arm/src/efm32/efm32_leserial.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <sys/types.h>
#include <stdint.h>
#include <stdbool.h>
#include <unistd.h>
#include <string.h>
#include <assert.h>
#include <errno.h>

#include <nuttx/debug.h>
#include <nuttx/irq.h>
#include <nuttx/arch.h>
#include <nuttx/serial/serial.h>
#include <nuttx/spinlock.h>

#include <arch/board/board.h>

#include "arm_internal.h"
#include "hardware/efm32_leuart.h"
#include "efm32_config.h"
#include "efm32_lowputc.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Some sanity checks *******************************************************/

/* Is there at least one UART enabled and configured as a RS-232 device? */

#ifndef HAVE_LEUART_DEVICE
#  warning "No LEUARTs enabled"
#endif

/* If we are not using the serial driver for the console, then we still must
 * provide some minimal implementation of up_putc.
 */

#ifdef USE_SERIALDRIVER

/* Which LEUART with be ttyLE0/console and which ttyLE1?  The console will
 * always be ttyLE0.  If there is no console then will use the lowest
 * numbered LEUART.
 */

/* First pick the console and ttys0.  This could be either LEUART0-1 */

#if defined(CONFIG_LEUART0_SERIAL_CONSOLE)
#    define CONSOLE_DEV         g_leuart0port /* LEUART0 is console */
#    define TTYLE0_DEV          g_leuart0port /* LEUART0 is ttyLE0 */
#    define LEUART0_ASSIGNED    1
#elif defined(CONFIG_LEUART1_SERIAL_CONSOLE)
#    define CONSOLE_DEV         g_leuart1port /* LEUART1 is console */
#    define TTYLE0_DEV          g_leuart1port /* LEUART1 is ttyLE0 */
#    define LEUART1_ASSIGNED    1
#else
#  undef CONSOLE_DEV                          /* No console */
#  if defined(CONFIG_EFM32_LEUART0)
#    define TTYLE0_DEV          g_leuart0port /* LEUART0 is ttyLE0 */
#    define LEUART0_ASSIGNED    1
#  elif defined(CONFIG_EFM32_LEUART1)
#    define TTYLE0_DEV          g_leuart1port /* LEUART1 is ttyLE0 */
#    define LEUART1_ASSIGNED    1
#  endif
#endif

/* Pick ttyLE1.  This could be any of LEUART0-1, excluding the and the
 * LEUART already selected for ttyLE0
 */

#if defined(CONFIG_EFM32_LEUART0) && !defined(LEUART0_ASSIGNED)
#  define TTYLE1_DEV            g_leuart0port /* LEUART0 is ttyLE1 */
#  define LEUART0_ASSIGNED      1
#elif defined(CONFIG_EFM32_LEUART1) && !defined(LEUART1_ASSIGNED)
#  define TTYLE1_DEV            g_leuart1port /* LEUART1 is ttyLE1 */
#  define LEUART1_ASSIGNED      1
#endif

/* TX/RX interrupts */

#define EFM32_TXERR_INTS      (LEUART_IEN_TXOF)
#define EFM32_RXERR_INTS      (LEUART_IEN_RXOF | LEUART_IEN_PERR | \
                               LEUART_IEN_FERR)
#ifdef CONFIG_DEBUG_FEATURES
#  define EFM32_TX_INTS       (LEUART_IEN_TXBL | EFM32_TXERR_INTS)
#  define EFM32_RX_INTS       (LEUART_IEN_RXDATAV | EFM32_RXERR_INTS)
#else
#  define EFM32_TX_INTS        LEUART_IEN_TXBL
#  define EFM32_RX_INTS        LEUART_IEN_RXDATAV
#endif

/****************************************************************************
 * Private Types
 ****************************************************************************/

struct efm32_config_s
{
  uintptr_t uartbase;  /* Base address of UART registers */
  uint32_t  baud;      /* Configured baud */
  uint8_t   irq;       /* IRQ associated with this LEUART (for enable) */
  uint8_t   parity;    /* 0=none, 1=odd, 2=even */
  uint8_t   bits;      /* Number of bits (8 or 9) */
  bool      stop2;     /* True: 2 stop bits */
};

struct efm32_leuart_s
{
  const struct efm32_config_s *config;
  uint16_t  ien;       /* Interrupts enabled */
  spinlock_t lock;     /* Spinlock */
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static inline uint32_t efm32_serialin(struct efm32_leuart_s *priv,
                                      int offset);
static inline void efm32_serialout(struct efm32_leuart_s *priv, int offset,
                                   uint32_t value);
static inline void efm32_setuartint(struct efm32_leuart_s *priv);

static void efm32_restoreuartint(struct efm32_leuart_s *priv, uint32_t ien);
static void efm32_disableuartint(struct efm32_leuart_s *priv, uint32_t *ien);
static int  efm32_setup(struct uart_dev_s *dev);
static void efm32_shutdown(struct uart_dev_s *dev);
static int  efm32_attach(struct uart_dev_s *dev);
static void efm32_detach(struct uart_dev_s *dev);
static int  efm32_interrupt(int irq, void *context, void *arg);
static int  efm32_ioctl(struct file *filep, int cmd, unsigned long arg);
static int  efm32_receive(struct uart_dev_s *dev, unsigned int *status);
static void efm32_rxint(struct uart_dev_s *dev, bool enable);
static bool efm32_rxavailable(struct uart_dev_s *dev);
static void efm32_send(struct uart_dev_s *dev, int ch);
static void efm32_txint(struct uart_dev_s *dev, bool enable);
static bool efm32_txready(struct uart_dev_s *dev);
static bool efm32_txempty(struct uart_dev_s *dev);

/****************************************************************************
 * Private Data
 ****************************************************************************/

static const struct uart_ops_s g_leuart_ops =
{
  .setup          = efm32_setup,
  .shutdown       = efm32_shutdown,
  .attach         = efm32_attach,
  .detach         = efm32_detach,
  .ioctl          = efm32_ioctl,
  .receive        = efm32_receive,
  .rxint          = efm32_rxint,
  .rxavailable    = efm32_rxavailable,
#ifdef CONFIG_SERIAL_IFLOWCONTROL
  .rxflowcontrol  = NULL,
#endif
  .send           = efm32_send,
  .txint          = efm32_txint,
  .txready        = efm32_txready,
  .txempty        = efm32_txempty,
};

/* I/O buffers */

#ifdef CONFIG_EFM32_LEUART0
static char g_leuart0rxbuffer[CONFIG_LEUART0_RXBUFSIZE];
static char g_leuart0txbuffer[CONFIG_LEUART0_TXBUFSIZE];
#endif
#ifdef CONFIG_EFM32_LEUART1
static char g_leuart1rxbuffer[CONFIG_LEUART1_RXBUFSIZE];
static char g_leuart1txbuffer[CONFIG_LEUART1_TXBUFSIZE];
#endif

/* This describes the state of the EFM32 LEUART0 port. */

#ifdef CONFIG_EFM32_LEUART0
static const struct efm32_config_s g_leuart0config =
{
  .uartbase  = EFM32_LEUART0_BASE,
  .baud      = CONFIG_LEUART0_BAUD,
  .irq       = EFM32_IRQ_LEUART0,
  .parity    = CONFIG_LEUART0_PARITY,
  .bits      = CONFIG_LEUART0_BITS,
  .stop2     = CONFIG_LEUART0_2STOP,
};

static struct efm32_leuart_s g_leuart0priv =
{
  .config    = &g_leuart0config,
  .lock      = SP_UNLOCKED
};

