apache/nuttx/arch/arm/src/efm32/efm32_leserial.c
static struct uart_dev_s g_leuart0port =
{
  .recv      =
  {
    .size    = CONFIG_LEUART0_RXBUFSIZE,
    .buffer  = g_leuart0rxbuffer,
  },
  .xmit      =
  {
    .size    = CONFIG_LEUART0_TXBUFSIZE,
    .buffer  = g_leuart0txbuffer,
  },
  .ops       = &g_leuart_ops,
  .priv      = &g_leuart0priv,
};
#endif

/* This describes the state of the EFM32 LEUART1 port. */

#ifdef CONFIG_EFM32_LEUART1
static struct efm32_config_s g_leuart1config =
{
  .uartbase  = EFM32_LEUART1_BASE,
  .baud      = CONFIG_LEUART1_BAUD,
  .irq       = EFM32_IRQ_LEUART1,
  .parity    = CONFIG_LEUART1_PARITY,
  .bits      = CONFIG_LEUART1_BITS,
  .stop2     = CONFIG_LEUART1_2STOP,
};

static struct efm32_leuart_s g_leuart1priv =
{
  .config    = &g_leuart1config,
  .lock      = SP_UNLOCKED
};

static struct uart_dev_s g_leuart1port =
{
  .recv      =
  {
    .size    = CONFIG_LEUART1_RXBUFSIZE,
    .buffer  = g_leuart1rxbuffer,
  },
  .xmit      =
  {
    .size    = CONFIG_LEUART1_TXBUFSIZE,
    .buffer  = g_leuart1txbuffer,
  },
  .ops       = &g_leuart_ops,
  .priv      = &g_leuart1priv,
};
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: efm32_serialin
 ****************************************************************************/

static inline uint32_t efm32_serialin(struct efm32_leuart_s *priv,
                                      int offset)
{
  return getreg32(priv->config->uartbase + offset);
}

/****************************************************************************
 * Name: efm32_serialout
 ****************************************************************************/

static inline void efm32_serialout(struct efm32_leuart_s *priv, int offset,
                                   uint32_t value)
{
  putreg32(value, priv->config->uartbase + offset);
}

/****************************************************************************
 * Name: efm32_setuartint
 ****************************************************************************/

static inline void efm32_setuartint(struct efm32_leuart_s *priv)
{
  efm32_serialout(priv, EFM32_LEUART_IEN_OFFSET, priv->ien);
}

/****************************************************************************
 * Name: efm32_restoreuartint
 ****************************************************************************/

static void efm32_restoreuartint_nolock(struct efm32_leuart_s *priv,
                                        uint32_t ien)
{
  /* Re-enable/re-disable interrupts corresponding to the state of
   * bits in ien.
   */

  priv->ien = ien;
  efm32_setuartint(priv);
}

static void efm32_restoreuartint(struct efm32_leuart_s *priv, uint32_t ien)
{
  irqstate_t flags;

  /* Re-enable/re-disable interrupts corresponding to the state of
   * bits in ien.
   */

  flags = spin_lock_irqsave(&priv->lock);
  efm32_restoreuartint_nolock(priv, ien);
  spin_unlock_irqrestore(&priv->lock, flags);
}

/****************************************************************************
 * Name: efm32_disableuartint
 ****************************************************************************/

static void efm32_disableuartint(struct efm32_leuart_s *priv, uint32_t *ien)
{
  irqstate_t flags;

  flags = spin_lock_irqsave(&priv->lock);
  if (ien)
    {
      *ien = priv->ien;
    }

  efm32_restoreuartint_nolock(priv, 0);
  spin_unlock_irqrestore(&priv->lock, flags);
}

/****************************************************************************
 * Name: efm32_setup
 *
 * Description:
 *   Configure the UART baud, bits, parity, etc. This method is called the
 *   first time that the serial port is opened.
 *
 ****************************************************************************/

static int efm32_setup(struct uart_dev_s *dev)
{
  struct efm32_leuart_s *priv = (struct efm32_leuart_s *)dev->priv;

#ifndef CONFIG_SUPPRESS_LEUART_CONFIG
  const struct efm32_config_s *config = priv->config;

  /* Configure the UART as an RS-232 UART */

  efm32_leuartconfigure(config->uartbase, config->baud, config->parity,
                        config->bits, config->stop2);
#endif

  /* Make sure that all interrupts are disabled */

  efm32_restoreuartint(priv, 0);
  return OK;
}

/****************************************************************************
 * Name: efm32_shutdown
 *
 * Description:
 *   Disable the UART.  This method is called when the serial
 *   port is closed
 *
 ****************************************************************************/

static void efm32_shutdown(struct uart_dev_s *dev)
{
  struct efm32_leuart_s *priv = (struct efm32_leuart_s *)dev->priv;

  /* Disable interrupts */

  efm32_restoreuartint(priv, 0);

  /* Reset the LEUART/UART by disabling it and restoring all of the registers
   * to the initial, reset value.  Only the ROUTE data set by efm32_lowsetup
   * is preserved.
   */

  efm32_leuart_reset(priv->config->uartbase);
}

/****************************************************************************
 * Name: efm32_attach
 *
 * Description:
 *   Configure the UART to operation in interrupt driven mode.  This method
 *   is called when the serial port is opened.  Normally, this is just after
 *   the setup() method is called, however, the serial console may operate in
 *   a non-interrupt driven mode during the boot phase.
 *
 *   RX and TX interrupts are not enabled when by the attach method (unless
 *   the hardware supports multiple levels of interrupt enabling).  The RX
 *   and TX interrupts are not enabled until the txint() and rxint() methods
 *   are called.
 *
 ****************************************************************************/

static int efm32_attach(struct uart_dev_s *dev)
{
  struct efm32_leuart_s *priv = (struct efm32_leuart_s *)dev->priv;
  const struct efm32_config_s *config = priv->config;
  int ret;

  /* Attach and enable the IRQ(s).  The interrupts are (probably) still
   * disabled in the C2 register.
   */

  ret = irq_attach(config->irq, efm32_interrupt, dev);
  if (ret >= 0)
    {
      up_enable_irq(config->irq);
    }

  return ret;
}

/****************************************************************************
 * Name: efm32_detach
 *
 * Description:
 *   Detach UART interrupts.  This method is called when the serial port
 *   is closed normally just before the shutdown method is called.  The
 *   exception is the serial console which is never shutdown.
 *
 ****************************************************************************/

static void efm32_detach(struct uart_dev_s *dev)
{
  struct efm32_leuart_s *priv = (struct efm32_leuart_s *)dev->priv;
  const struct efm32_config_s *config = priv->config;

  /* Disable interrupts */

  efm32_restoreuartint(priv, 0);
  up_disable_irq(config->irq);

